In [1]:
import pandas as pd

#### Question 1

In [2]:
df_1 = pd.read_csv('../data/Students_info_0.csv')
df_2 = pd.read_csv('../data/Students_marks_0.csv')
df = df_1.merge(df_2)
df_1.shape, df_2.shape, df.shape

((100, 7), (100, 4), (100, 10))

In [3]:
for i in range(1, 10):
    df_1 = pd.read_csv('../data/Students_info_%s.csv' %i)
    df_2 = pd.read_csv('../data/Students_marks_%s.csv' %i)
    df_temp = df_1.merge(df_2)
    df = pd.concat([df, df_temp])

In [4]:
print(df.shape)
df.head(3)

(1000, 10)

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93

#### Question 2

In [5]:
del df['index']
df.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88

#### Question 3

In [6]:
df.shape

(1000, 9)

#### Question 4

In [7]:
print(df.dtypes)
df.describe()

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
group                          object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Question 5

In [8]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
group                          0
math score                     0
reading score                  0
writing score                  0
dtype: int64

#### Question 6

In [9]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

In [10]:
df[['math score', 'reading score', 'writing score']].mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

#### Question 7

In [11]:
df_prep = pd.DataFrame(df.groupby('test preparation course')[['math score', 'reading score', 'writing score']].mean())
df_prep

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

#### Question 8

In [12]:
df['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

#### Question 9

In [13]:
df = df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})
df.head(3)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93

#### Question 10

Процент сдавших математику

In [14]:
passmark = 50
round((df['math score'] > passmark).mean(), 2)

0.85

Процент сдавших математику среди прошедших курс

In [15]:
df_prep = df[df['test preparation'] == 'completed']
round((df_prep['math score'] > passmark).mean(), 2)

0.91

Процент женщин, не проходивших курс подготовки к экзамену и не сдавших математику

In [16]:
df_prep = df[(df['test preparation'] == 'none') & (df['gender'] == 'female')]
round((df_prep['math score'] <= passmark).mean(), 2)

0.23

#### Question 11

In [18]:
%%time
df.groupby('race/ethnicity')['reading score'].mean()

CPU times: total: 0 ns
Wall time: 2 ms

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [20]:
%%time
df.groupby('education')['writing score'].min()

CPU times: total: 0 ns
Wall time: 999 µs

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

#### Question 12

In [21]:
race_list = df['race/ethnicity'].unique()

In [37]:
%%time
for c in race_list:
    a = df[df['race/ethnicity'] == c]['reading score'].sum()/df[df['race/ethnicity'] == c]['reading score'].count()
    print(c,':', a)

group B : 67.35263157894737
group C : 69.10344827586206
group A : 64.67415730337079
group D : 70.03053435114504
group E : 73.02857142857142
CPU times: total: 31.2 ms
Wall time: 13 ms

In [40]:
education_list = df['education'].unique()

In [41]:
%%time
for c in education_list:
    a = df[df['education'] == c]['writing score'].min()
    print(c,':', a)

bachelor's degree : 38
some college : 19
master's degree : 46
associate's degree : 35
high school : 15
some high school : 10
CPU times: total: 0 ns
Wall time: 9.99 ms

#### Question 13

In [42]:
grouped = pd.pivot_table(df,index=['gender','education'])
grouped

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

In [44]:
df.head(3)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93

In [51]:
df.groupby(['gender','education'])[['math score', 'reading score', 'writing score']].mean()

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Question 14

In [55]:
exams = ['math', 'reading', 'writing']
for e in exams:
    df['%s_pass_status' %e] = df['%s score' %e].apply(lambda x: 'P' if x > passmark else 'F' )

In [64]:
df['math_pass_status'].value_counts()

P    850
F    150
Name: math_pass_status, dtype: int64

In [74]:
df.head(3)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,math_pass_status,reading_pass_status,writing_pass_status
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P

#### Question 15

In [97]:
df['over_all_pass_status '] = (df['math_pass_status'] == 'P') & (df['reading_pass_status'] == 'P') & (df['writing_pass_status'] == 'P')
df['over_all_pass_status '] = df['over_all_pass_status '].apply(lambda x: 'P' if x == True else 'F')

In [99]:
df['over_all_pass_status '].value_counts()

P    796
F    204
Name: over_all_pass_status , dtype: int64

#### Question 16

In [124]:
def GetGrade(average_mark):
    grade_dict = {90: 'A', 80: 'B', 70 : 'C', 60: 'D', 50: 'E', 0: 'F'}
    for grade in grade_dict:
        if average_mark > grade:
            mark = grade_dict[grade]
            break
    return mark

In [125]:
df['grade'] = (df['math score'] + df['reading score'] + df['writing score']) / 3
df['grade'] = df['grade'].apply(GetGrade)

In [130]:
df['grade'].value_counts().sort_index()

A     50
B    144
C    253
D    260
E    184
F    109
Name: grade, dtype: int64